In [ ]:
!pip install mysql-connector-python

In [ ]:
sql = ("DROP TABLE Dgreee1")

In [ ]:
sql = ("DROP DATABASES abc1")

In [2]:
import mysql.connector as conn

In [3]:
mydb = conn.connect(host='localhost',
            user='root',
            password='12345')

In [4]:
print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x0000021588EA8A60>

In [6]:
mydb = conn.connect(host='localhost',
            user='root',
            password='12345')

mycursor = mydb.cursor()

mycursor.execute("CREATE DATABASE if not exists abc1")

In [7]:
# Error 1045(28000)

# Error 2003

In [8]:
mycursor.execute("SHOW DATABASES")

for i in mycursor:
    print(i)

('abc',)
('abc1',)
('abc123',)
('adf',)
('buld_data',)
('bulk_data',)
('demo',)
('divisible1',)
('dress1',)
('dress_bulk_data',)
('dress_data',)
('dress_data1',)
('dress_data2',)
('ebb',)
('ebb_csv',)
('employee',)
('first',)
('first1',)
('hotel_reservation_system',)
('icc_cup',)
('ineuron',)
('ineuron_partition',)
('information_schema',)
('intro_sql',)
('key_prim',)
('mysql',)
('numbers',)
('performance_schema',)
('retailed',)
('retailers',)
('sakila',)
('salary',)
('sales',)
('shivan_fsda',)
('sudhanshu',)
('sys',)
('win_fun',)
('world',)

In [9]:
mydb = conn.connect(host='localhost',
            user='root',
            password='12345',
            database = "abc1")

In [10]:
mydb

In [ ]:
# Crate Table

In [ ]:
mycursor = mydb.cursor()

mycursor.execute("CREATE TABLE if not exists Dgreee1 (name VARCHAR(30), stream VARCHAR(30), roll_number int, collage_name VARCHAR(30))")

In [ ]:
mycursor.execute("SHOW TABLES")

for i in mycursor:
    print(i)

In [ ]:
mycursor = mydb.cursor()

mycursor.execute("CREATE TABLE Dgreee1 (name VARCHAR(30), stream VARCHAR(30), roll_number int, collage_name VARCHAR(30))")

Always Use Alter command whenever you want to add some new columns in your existing table.

In [ ]:
mycursor = mydb.curosr()

mycursor.execute("ALTER TABLE degree1 ADD COLUMN id INT AUTO INCREMENT PRIMARY KEY")

In [ ]:
mycursor.execute("EXPLAIN Dgreee1")

for x in mycursor:
  print(x)

In [ ]:
sql = "INSERT INTO Dgreee1(name,stream,roll_number,collage_name) VALUES (%s, %s, %s, %s)"

val = ("SHIVAN", 'CSE', '163', "PTU")

mydb.commit()

print(mycursor.rowcount,"Data Insereted.")

In [12]:
sql = "INSERT INTO Dgreee1(name,stream,roll_number,collage_name) VALUES (%s, %s, %s, %s)"

val = [('sanju', 'CSE', '123', 'PTU'),
('sanju', 'CSE', '123', 'PTU'),
('Depika', 'CSE', '123', 'LPTU'),
('Jayant', 'BIO', '34', 'UPTU'),
('Jawala', 'CIVL', '566', 'UPTU'),
('Nishtha', 'Mech', '322', 'LPTU'),
('sanju', 'CSE', '112', 'PTU'),
('Reebha', 'Mech', '678', 'RPTU'),
('Shubham', 'CIVIL', '344', 'RTU'),
('Deepranjan', 'CSE', '567', 'PTU'),
('Khusboo', 'CIVIL', '456', 'RPTU')]

mycursor.executemany(sql, val)

mydb.commit()

print(mycursor.rowcount, "was inserted.")

11 was inserted.

In [13]:
mycursor.execute("SELECT * FROM Dgreee1")

myresult = mycursor.fetchall()

for i in myresult:
    print(i)

('sanju', 'CSE', 123, 'PTU')
('sanju', 'CSE', 123, 'PTU')
('sanju', 'CSE', 123, 'LPTU')
('sanju', 'BIO', 34, 'UPTU')
('sanju', 'CIVL', 566, 'UPTU')
('sanju', 'Mech', 322, 'LPTU')
('sanju', 'CSE', 112, 'PTU')
('sanju', 'Mech', 678, 'RPTU')
('sanju', 'CIVIL', 344, 'RTU')
('sanju', 'CSE', 567, 'PTU')
('sanju', 'CIVIL', 456, 'RPTU')
('sanju', 'CSE', 123, 'PTU')
('sanju', 'CSE', 123, 'PTU')
('Depika', 'CSE', 123, 'LPTU')
('Jayant', 'BIO', 34, 'UPTU')
('Jawala', 'CIVL', 566, 'UPTU')
('Nishtha', 'Mech', 322, 'LPTU')
('sanju', 'CSE', 112, 'PTU')
('Reebha', 'Mech', 678, 'RPTU')
('Shubham', 'CIVIL', 344, 'RTU')
('Deepranjan', 'CSE', 567, 'PTU')
('Khusboo', 'CIVIL', 456, 'RPTU')
('sanju', 'CSE', 123, 'PTU')
('sanju', 'CSE', 123, 'PTU')
('Depika', 'CSE', 123, 'LPTU')
('Jayant', 'BIO', 34, 'UPTU')
('Jawala', 'CIVL', 566, 'UPTU')
('Nishtha', 'Mech', 322, 'LPTU')
('sanju', 'CSE', 112, 'PTU')
('Reebha', 'Mech', 678, 'RPTU')
('Shubham', 'CIVIL', 344, 'RTU')
('Deepranjan', 'CSE', 567, 'PTU')
('Khusboo', 'CIVIL', 456, 'RPTU')
('sanju', 'CSE', 123, 'PTU')
('sanju', 'CSE', 123, 'PTU')
('Depika', 'CSE', 123, 'LPTU')
('Jayant', 'BIO', 34, 'UPTU')
('Jawala', 'CIVL', 566, 'UPTU')
('Nishtha', 'Mech', 322, 'LPTU')
('sanju', 'CSE', 112, 'PTU')
('Reebha', 'Mech', 678, 'RPTU')
('Shubham', 'CIVIL', 344, 'RTU')
('Deepranjan', 'CSE', 567, 'PTU')
('Khusboo', 'CIVIL', 456, 'RPTU')

In [ ]:
mycursor.execute("SELECT name, stream, collage_name from Dgreee1")

myresult = mycursor.fetchall()

for i in myresult:
    print(i)

In [ ]:
mycursor.execute("SELECT * FROM Dgreee1")

myresult = mycursor.fetchone()

print(myresult)

In [ ]:
#Unread One - DROP Table and Database and restart your kernal

# Where

In [14]:
mycursor = mydb.cursor()

sql = "SELECT * from Dgreee1 WHERE collage_name = 'RPTU'"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for i in myresult:
    print(i)

('sanju', 'Mech', 678, 'RPTU')
('sanju', 'CIVIL', 456, 'RPTU')
('Reebha', 'Mech', 678, 'RPTU')
('Khusboo', 'CIVIL', 456, 'RPTU')
('Reebha', 'Mech', 678, 'RPTU')
('Khusboo', 'CIVIL', 456, 'RPTU')
('Reebha', 'Mech', 678, 'RPTU')
('Khusboo', 'CIVIL', 456, 'RPTU')

In [15]:
mycursor = mydb.cursor()

sql = "SELECT * from Dgreee1 WHERE collage_name = 'PTU'"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for i in myresult:
    print(i)

('sanju', 'CSE', 123, 'PTU')
('sanju', 'CSE', 123, 'PTU')
('sanju', 'CSE', 112, 'PTU')
('sanju', 'CSE', 567, 'PTU')
('sanju', 'CSE', 123, 'PTU')
('sanju', 'CSE', 123, 'PTU')
('sanju', 'CSE', 112, 'PTU')
('Deepranjan', 'CSE', 567, 'PTU')
('sanju', 'CSE', 123, 'PTU')
('sanju', 'CSE', 123, 'PTU')
('sanju', 'CSE', 112, 'PTU')
('Deepranjan', 'CSE', 567, 'PTU')
('sanju', 'CSE', 123, 'PTU')
('sanju', 'CSE', 123, 'PTU')
('sanju', 'CSE', 112, 'PTU')
('Deepranjan', 'CSE', 567, 'PTU')

In [16]:
mycursor = mydb.cursor()

sql = "SELECT * from Dgreee1 WHERE collage_name LIKE '%U%'"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for i in myresult:
    print(i)

('sanju', 'CSE', 123, 'PTU')
('sanju', 'CSE', 123, 'PTU')
('sanju', 'CSE', 123, 'LPTU')
('sanju', 'BIO', 34, 'UPTU')
('sanju', 'CIVL', 566, 'UPTU')
('sanju', 'Mech', 322, 'LPTU')
('sanju', 'CSE', 112, 'PTU')
('sanju', 'Mech', 678, 'RPTU')
('sanju', 'CIVIL', 344, 'RTU')
('sanju', 'CSE', 567, 'PTU')
('sanju', 'CIVIL', 456, 'RPTU')
('sanju', 'CSE', 123, 'PTU')
('sanju', 'CSE', 123, 'PTU')
('Depika', 'CSE', 123, 'LPTU')
('Jayant', 'BIO', 34, 'UPTU')
('Jawala', 'CIVL', 566, 'UPTU')
('Nishtha', 'Mech', 322, 'LPTU')
('sanju', 'CSE', 112, 'PTU')
('Reebha', 'Mech', 678, 'RPTU')
('Shubham', 'CIVIL', 344, 'RTU')
('Deepranjan', 'CSE', 567, 'PTU')
('Khusboo', 'CIVIL', 456, 'RPTU')
('sanju', 'CSE', 123, 'PTU')
('sanju', 'CSE', 123, 'PTU')
('Depika', 'CSE', 123, 'LPTU')
('Jayant', 'BIO', 34, 'UPTU')
('Jawala', 'CIVL', 566, 'UPTU')
('Nishtha', 'Mech', 322, 'LPTU')
('sanju', 'CSE', 112, 'PTU')
('Reebha', 'Mech', 678, 'RPTU')
('Shubham', 'CIVIL', 344, 'RTU')
('Deepranjan', 'CSE', 567, 'PTU')
('Khusboo', 'CIVIL', 456, 'RPTU')
('sanju', 'CSE', 123, 'PTU')
('sanju', 'CSE', 123, 'PTU')
('Depika', 'CSE', 123, 'LPTU')
('Jayant', 'BIO', 34, 'UPTU')
('Jawala', 'CIVL', 566, 'UPTU')
('Nishtha', 'Mech', 322, 'LPTU')
('sanju', 'CSE', 112, 'PTU')
('Reebha', 'Mech', 678, 'RPTU')
('Shubham', 'CIVIL', 344, 'RTU')
('Deepranjan', 'CSE', 567, 'PTU')
('Khusboo', 'CIVIL', 456, 'RPTU')

In [17]:
mycursor = mydb.cursor()

sql = "SELECT * from Dgreee1 WHERE collage_name LIKE '%L%'"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for i in myresult:
    print(i)

('sanju', 'CSE', 123, 'LPTU')
('sanju', 'Mech', 322, 'LPTU')
('Depika', 'CSE', 123, 'LPTU')
('Nishtha', 'Mech', 322, 'LPTU')
('Depika', 'CSE', 123, 'LPTU')
('Nishtha', 'Mech', 322, 'LPTU')
('Depika', 'CSE', 123, 'LPTU')
('Nishtha', 'Mech', 322, 'LPTU')

# ORDER BY

Sort by assending and Decending Order

In [18]:
sql = "SELECT * FROM Dgreee1 ORDER By name"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for i in myresult:
    print(i)

('Deepranjan', 'CSE', 567, 'PTU')
('Deepranjan', 'CSE', 567, 'PTU')
('Deepranjan', 'CSE', 567, 'PTU')
('Depika', 'CSE', 123, 'LPTU')
('Depika', 'CSE', 123, 'LPTU')
('Depika', 'CSE', 123, 'LPTU')
('Jawala', 'CIVL', 566, 'UPTU')
('Jawala', 'CIVL', 566, 'UPTU')
('Jawala', 'CIVL', 566, 'UPTU')
('Jayant', 'BIO', 34, 'UPTU')
('Jayant', 'BIO', 34, 'UPTU')
('Jayant', 'BIO', 34, 'UPTU')
('Khusboo', 'CIVIL', 456, 'RPTU')
('Khusboo', 'CIVIL', 456, 'RPTU')
('Khusboo', 'CIVIL', 456, 'RPTU')
('Nishtha', 'Mech', 322, 'LPTU')
('Nishtha', 'Mech', 322, 'LPTU')
('Nishtha', 'Mech', 322, 'LPTU')
('Reebha', 'Mech', 678, 'RPTU')
('Reebha', 'Mech', 678, 'RPTU')
('Reebha', 'Mech', 678, 'RPTU')
('sanju', 'CSE', 123, 'PTU')
('sanju', 'Mech', 322, 'LPTU')
('sanju', 'CSE', 123, 'PTU')
('sanju', 'CSE', 123, 'PTU')
('sanju', 'CSE', 123, 'PTU')
('sanju', 'CSE', 123, 'PTU')
('sanju', 'CSE', 112, 'PTU')
('sanju', 'CSE', 123, 'LPTU')
('sanju', 'BIO', 34, 'UPTU')
('sanju', 'CIVL', 566, 'UPTU')
('sanju', 'CSE', 112, 'PTU')
('sanju', 'CSE', 123, 'PTU')
('sanju', 'Mech', 678, 'RPTU')
('sanju', 'CIVIL', 344, 'RTU')
('sanju', 'CSE', 567, 'PTU')
('sanju', 'CSE', 112, 'PTU')
('sanju', 'CSE', 112, 'PTU')
('sanju', 'CIVIL', 456, 'RPTU')
('sanju', 'CSE', 123, 'PTU')
('sanju', 'CSE', 123, 'PTU')
('Shubham', 'CIVIL', 344, 'RTU')
('Shubham', 'CIVIL', 344, 'RTU')
('Shubham', 'CIVIL', 344, 'RTU')

In [19]:
sql = "SELECT * FROM Dgreee1 ORDER By name DESC"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for i in myresult:
    print(i)

('Shubham', 'CIVIL', 344, 'RTU')
('Shubham', 'CIVIL', 344, 'RTU')
('Shubham', 'CIVIL', 344, 'RTU')
('sanju', 'CSE', 123, 'PTU')
('sanju', 'CSE', 123, 'PTU')
('sanju', 'CSE', 123, 'LPTU')
('sanju', 'BIO', 34, 'UPTU')
('sanju', 'CIVL', 566, 'UPTU')
('sanju', 'Mech', 322, 'LPTU')
('sanju', 'CSE', 112, 'PTU')
('sanju', 'Mech', 678, 'RPTU')
('sanju', 'CIVIL', 344, 'RTU')
('sanju', 'CSE', 567, 'PTU')
('sanju', 'CIVIL', 456, 'RPTU')
('sanju', 'CSE', 123, 'PTU')
('sanju', 'CSE', 123, 'PTU')
('sanju', 'CSE', 123, 'PTU')
('sanju', 'CSE', 112, 'PTU')
('sanju', 'CSE', 123, 'PTU')
('sanju', 'CSE', 123, 'PTU')
('sanju', 'CSE', 112, 'PTU')
('sanju', 'CSE', 112, 'PTU')
('sanju', 'CSE', 123, 'PTU')
('Reebha', 'Mech', 678, 'RPTU')
('Reebha', 'Mech', 678, 'RPTU')
('Reebha', 'Mech', 678, 'RPTU')
('Nishtha', 'Mech', 322, 'LPTU')
('Nishtha', 'Mech', 322, 'LPTU')
('Nishtha', 'Mech', 322, 'LPTU')
('Khusboo', 'CIVIL', 456, 'RPTU')
('Khusboo', 'CIVIL', 456, 'RPTU')
('Khusboo', 'CIVIL', 456, 'RPTU')
('Jayant', 'BIO', 34, 'UPTU')
('Jayant', 'BIO', 34, 'UPTU')
('Jayant', 'BIO', 34, 'UPTU')
('Jawala', 'CIVL', 566, 'UPTU')
('Jawala', 'CIVL', 566, 'UPTU')
('Jawala', 'CIVL', 566, 'UPTU')
('Depika', 'CSE', 123, 'LPTU')
('Depika', 'CSE', 123, 'LPTU')
('Depika', 'CSE', 123, 'LPTU')
('Deepranjan', 'CSE', 567, 'PTU')
('Deepranjan', 'CSE', 567, 'PTU')
('Deepranjan', 'CSE', 567, 'PTU')

In [25]:
sql = "DELETE FROM Dgreee1 WHERE name = 'Sanju'"

mycursor.execute(sql)

mydb.commit() 
print(mycursor.rowcount, "Record Deleted")

20 Record Deleted

In [26]:
sql = "SELECT * FROM Dgreee1 ORDER By name DESC"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for i in myresult:
    print(i)

('Shubham', 'CIVIL', 344, 'RTU')
('Shubham', 'CIVIL', 344, 'RTU')
('Shubham', 'CIVIL', 344, 'RTU')
('Reebha', 'Mech', 678, 'RPTU')
('Reebha', 'Mech', 678, 'RPTU')
('Reebha', 'Mech', 678, 'RPTU')
('Nishtha', 'Mech', 322, 'LPTU')
('Nishtha', 'Mech', 322, 'LPTU')
('Nishtha', 'Mech', 322, 'LPTU')
('Khusboo', 'CIVIL', 456, 'RPTU')
('Khusboo', 'CIVIL', 456, 'RPTU')
('Khusboo', 'CIVIL', 456, 'RPTU')
('Jayant', 'BIO', 34, 'UPTU')
('Jayant', 'BIO', 34, 'UPTU')
('Jayant', 'BIO', 34, 'UPTU')
('Jawala', 'CIVL', 566, 'UPTU')
('Jawala', 'CIVL', 566, 'UPTU')
('Jawala', 'CIVL', 566, 'UPTU')
('Depika', 'CSE', 123, 'LPTU')
('Depika', 'CSE', 123, 'LPTU')
('Depika', 'CSE', 123, 'LPTU')
('Deepranjan', 'CSE', 567, 'PTU')
('Deepranjan', 'CSE', 567, 'PTU')
('Deepranjan', 'CSE', 567, 'PTU')

In [31]:
sql = "UPDATE Dgreee1 SET collage_name = 'SUSCET' WHERE collage_name = 'RPTU'"
mycursor.execute(sql)

mydb.commit() 
print(mycursor.rowcount, "Record Affected")

6 Record Affected

In [32]:
sql = "SELECT * FROM Dgreee1 ORDER By name DESC"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for i in myresult:
    print(i)

('Shubham', 'CIVIL', 344, 'RTU')
('Shubham', 'CIVIL', 344, 'RTU')
('Shubham', 'CIVIL', 344, 'RTU')
('Reebha', 'Mech', 678, 'SUSCET')
('Reebha', 'Mech', 678, 'SUSCET')
('Reebha', 'Mech', 678, 'SUSCET')
('Nishtha', 'Mech', 322, 'LPTU')
('Nishtha', 'Mech', 322, 'LPTU')
('Nishtha', 'Mech', 322, 'LPTU')
('Khusboo', 'CIVIL', 456, 'SUSCET')
('Khusboo', 'CIVIL', 456, 'SUSCET')
('Khusboo', 'CIVIL', 456, 'SUSCET')
('Jayant', 'BIO', 34, 'UPTU')
('Jayant', 'BIO', 34, 'UPTU')
('Jayant', 'BIO', 34, 'UPTU')
('Jawala', 'CIVL', 566, 'UPTU')
('Jawala', 'CIVL', 566, 'UPTU')
('Jawala', 'CIVL', 566, 'UPTU')
('Depika', 'CSE', 123, 'LPTU')
('Depika', 'CSE', 123, 'LPTU')
('Depika', 'CSE', 123, 'LPTU')
('Deepranjan', 'CSE', 567, 'PTU')
('Deepranjan', 'CSE', 567, 'PTU')
('Deepranjan', 'CSE', 567, 'PTU')

In [33]:
mycursor.execute("SELECT * FROM Dgreee1 LIMIT 5")

myresult = mycursor.fetchall()

for i in myresult:
    print(i)

('Depika', 'CSE', 123, 'LPTU')
('Jayant', 'BIO', 34, 'UPTU')
('Jawala', 'CIVL', 566, 'UPTU')
('Nishtha', 'Mech', 322, 'LPTU')
('Reebha', 'Mech', 678, 'SUSCET')

In [35]:
mycursor.execute("SELECT * FROM Dgreee1 LIMIT 5 OFFSET 3")

myresult = mycursor.fetchall()

for i in myresult:
    print(i)

('Nishtha', 'Mech', 322, 'LPTU')
('Reebha', 'Mech', 678, 'SUSCET')
('Shubham', 'CIVIL', 344, 'RTU')
('Deepranjan', 'CSE', 567, 'PTU')
('Khusboo', 'CIVIL', 456, 'SUSCET')

In [36]:
mycursor = mydb.cursor()

sql = "DROP TABLE Dgreee1"

mycursor.execute(sql)

In [37]:
mycursor = mydb.cursor()

sql = "DROP TABLE IF EXISTS Dgreee1"

mycursor.execute(sql)

In [ ]:
# Unread